// 자바스크립트에서 문자는 따옴표가 필요하다. 
// class="수업" 같은 것은 애러가 난다. 예약어라고 한다. 



// 접근하는데 두가지 함수가 필요하다. 

// alert()

// console.log()


name="mike";
age=30;


alert(name);


마지막으로 덮어씨여짐. 

let()      ----> 이미 선언되어있다는 것을 알 수 있음. 렛을 생략하고 적으면 됨. 최초로 선언하는 변수에 let을 쓰면 됨. 

const()    ----> 절대로 바뀌지 않는 변수, 파이, 생일 등, 대문자.

모든 변수 const
변경될 여지가 있는 것 let

1. 변수는 문자와 숫자, $와 _만 사용할 수 있음. 
2. 첫글자는 숫자가 될 수 없다. 
3. 예약어는 사용할 수 없습니다. 
4. 가급적 상수는 대문자로 알려주어야 한다. 
5. 변수명은 읽기 쉽고 이해할 수 있게 선언해야 한다. 


let name= "Mike";


const가 있음. 절대로 바뀌지 않는 상수